---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsBranchPanelSchedule
source: html/6c9ef6ab-a248-040f-f717-a0a8fc9b74f2.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsBranchPanelSchedule Property

Checks to see if this object is branch panel schedule template element.

## Syntax (C#)
```csharp
public bool IsBranchPanelSchedule { get; }
```